/*******************************************************************************
Copyright 2008 - 2016 深圳市信盈达科技有限公司. All rights reserved.
文件名:        ii.h
描述   :       模拟iic头文件
作者   :       Jahol Fan
版本   :       V1.0
修改   :   
完成日期：     2016.9.19
*******************************************************************************/
#ifndef _IIC_H
#define _IIC_H

#ifdef __cplusplus
extern "C"
{
#endif

/*********************************************************************
 * INCLUDES
 */
#include "stm32f4xx.h"
/*********************************************************************
 * TYPEDEFS
 */
/*********************************************************************
*  EXTERNAL VARIABLES
*/

/*********************************************************************
 * CONSTANTS
 */



/*********************************************************************
 * MACROS
 */

/*********************************************************************
 *PUBLIC FUNCTIONS DECLARE
 */
void IIC_init(void);
void IIC_start(void);
void IIC_stop(void);
u8 IIC_waitAck(void);
void IIC_ack(void);
void IIC_nAck(void);
void IIC_sendByte(u8 txd);
u8 IIC_readByte(unsigned char ack);




/*********************************************************************
*********************************************************************/

#ifdef __cplusplus
}
#endif

#endif /* _IIC_H */
